1. Хранение текущего количества студентов в группе. #int
#Количество людей может быть только целым и дискретным числом.

2. Хранение температуры в градусах Цельсия (например, 23.5). #float
#Температура — это непрерывная величина. Она часто содержит дробную часть для точных измерений (например, 23.5).

3. Хранение логина пользователя (например, "ivanov_ivan"). #str
#Логин представляет собой текстовую последовательность символов, букв и знаков препинания.

4. Хранение информации о том, включено ли уведомление (да/нет). #bool
#Логический тип идеально подходит для флагов состояния, принимающих всего два взаимоисключающих значения: True (включено/да) или False (выключено/нет).

5. Хранение списка любимых фильмов. #list
#Список фильмов — это упорядоченная коллекция, в которую пользователь захочет добавлять новые элементы, удалять старые или менять их местами.

6. Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания. #tuple
#Кортеж строго упорядочен и неизменяем. Это гарантирует, что координаты точки случайно не перезапишутся во время работы программы.

7. Хранение уникальных ID товаров в корзине покупок. #set
#Множество автоматически исключает любые дубликаты и хранит только уникальные элементы. Это защитит от случайного повторного добавления одного и того же ID.

8. Хранение соответствия между названием страны и её столицей. #dict
#Словарь хранит данные в формате пар «ключ: значение». В качестве ключа удобно использовать уникальное название страны, а в качестве значения — её столицу.